Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: (⊙_⊙)这……是什么？！
en_us: (⊙_⊙) What... is this?

source: F你妹啊，你以为这是选秀啊！你怎么不让人家干脆来段说唱啊喂？！
en_us: F*ck you Sister, did you think this is a talent show!? How about you let them just sing a verse, huh?!

source: MDZZ！
en_us: F*cking retards!

source: MD，人比人气死人。他绝对是老天爷抱养的孩子，羿清才是亲生的！
en_us: Damn it, there's no use comparing. Lonemoon felt as if he was a bastard to the Heavens — Yi Qing was definitely the true son.

source: MD，心好累，想辞职！
en_us: Damn it. His heart was tired and he wanted to quit!

source: MMP!
en_us: Son of a bitch!

source: MMP！
en_us: Son of a b*tch!

source: MMP！说好的没事呢？
en_us: Son of a b*tch! Didn't he say it would be fine?

source: MMP，老子再也不想管这对师徒了！
en_us: To hell with this master disciple duo!

source: Σ(°△°|||)︴石化中……
en_us: Σ(°△°|||) Fossilizing...

source: ——呸！
en_us: Pui!

source: ——第一届暨最后一届万妖大会，落幕！
en_us: —The curtain closed on the first and last Myriad Demon Congregation!

source: “MD，老子切了你！”他直接拔出剑就冲了上去。
en_us: "Damn it, I will slaughter you!" He drew his sword and charged toward the radish.

source: “……”MD，要不是厨子闭关，她才不管这只矫情鬼！
en_us: "..." Damnit, if not for the fact that Chef was about to go into seclusion, she would not have bothered with this spoiled brat!

source: “……”MMP！
en_us: Son of a b*tch!

source: “……”不是你让问的吗？
en_us: "..." Weren't you the one who made me ask?

source: “……”不知道，你来当什么护卫！掌事嘴角一抽，又不好得罪一个金丹道君，“那……两人一共三块下品灵石，怎么样？”
en_us: "…" Don't know, then what kind of guard did you intend to be! The steward twitched his mouth, but he could not offend a Golden Core Dao Lord. "Then… two of you will share three pieces of low-grade spirit stones, how about that?"

source: “……”也没说要找毛团啊，她口味还没这么重。
en_us: "..." I didn't say I want to partner Furball. She didn't have that strange a taste.

source: “……”什么团？
en_us: "..." What ball?

source: “……”什么都没有啊喂？
en_us: "..." There is nothing there?

source: “……”什么鬼，“那鱼呢？”
en_us: “……”What the Heck，“Then, where is the fish now？”

source: “……”什么鬼？
en_us: "..." What the hell?

source: “……”从天而降，是这个世界惯用的出场方式吗？还好……菜已经吃完了。
en_us: "…" Are things always introduced by dropping from the sky in this world? Thank goodness… I finished eating the dishes.

source: “……”他上次就顺口一说，你还真是不客气啊，拖家带口就来了。
en_us: "..." He only mentioned it casually the previous time, but yet he really took him seriously and brought his entire family over.

source: “……”他原本俊俏的仙容上，突出拳头大小一块红肿，在他一身白衣的映衬下，显得特别闪亮。
en_us: "..." His once perfect face was now swollen where Shen Ying had punched him. His shimmering robe was now shining more brightly.

source: “……”他能说不吗？
en_us: “……”Can he even say no？

source: “……”他说啥了？
en_us: "..." What did I say?

source: “……”他转头看了看黑衣的猫，蓝衣的羿清，青衣的沈萤。他居然无法反驳。
en_us: "..." He glanced at everyone standing around him. The cat was in black, Yi Qing was in blue and Shen Ying was in green. He couldn't think of a comeback.

source: “……”众人面面相觑了会，才小心翼翼的问，“掌门，您……忘了？”
en_us: "..." Everyone exchanged glances. One of them asked warily, "Sect Master, don't you... remember?"

source: “……”众人齐齐沉默了。
en_us: "..." The crowd fell silent.

source: “……”你TM就只记得烤鸡吗？
en_us: "…" Are roasted chickens the only f**king thing you can remember?

source: “……”你丫啥时候给我说过了？老子神TM会知道啊喂？
en_us: "…”Dude, since when did you ever mention that to me？How was I suppose to freaking know about it?

source: “……”你们师徒是来讨债的吗？TM就不能给我留一点，“连人名都记不住，怎么这种事你就记得这么清楚，给给给，全还给你，满意了吧？”
en_us: "…" Are you two master-disciple pair out to collect debts? Can't you bloody leave some for me? "You can't even remember the names of people, how come you can remember this kind of thing so well. Here, take, take, take, I give them all back to you, are you satisfied?"

source: “……”你已经揍了！
en_us: "..." You already hit me!

source: “……”公放什么鬼？
en_us: "..." What the hell was public mode?

source: “……”到是听人把话说完啊喂，仙魂只好看向旁边的孤月，“这位有缘人，你……”
en_us: "…" Hey, you should listen to what someone is saying first. The immortal soul could only look over to Lonemoon and try again. "Since we have affinity, you…"

source: “……”卧槽，你到底对这只兔子做了什么啊喂！“算了，我不管了，你们爱咋咋滴。”
en_us: "…" Holy shit! What exactly did you do to this rabbit? "Forget it, I give up. You can all do what you like."

source: “……”卧槽，该情还是个爱情故事，他说为啥它怀里那个死婴是人形，原来生母是人。
en_us: "…" Holy shit, there was a love story behind all this! Lonemoon had been wondering why the dead baby in the fox demon's arms had a human form — it was because its mother was actually a human.

source: “……”卧槽，还真是啊喂。
en_us: "..." Holy shit, this is for real.

source: “……”厨子原本是个这么有职业操守的人吗？
en_us: "..." Was Chef always so professional?

source: “……”叫妖王来修房子！
en_us: "…" Asked a Demon Monarch to fix the house!

source: “……”吃鸡吃鸡吃鸡。
en_us: "…" Someone was still eating chicken nonstop.

source: “……”呃，只是看你同一个菜，加了三次咸，想问句还能吃吗？
en_us: "…" Uh, it’s just that the same dish has been seasoned with salt thrice, and I wanted to ask if it is still edible?

source: “……”呃，有这种事吗？他细一想自己的确有给她介绍过各种武器，难怪是那个时候？可是他以前不是个丢三落四的人啊，为啥给她看过就忘了收了？
en_us: "…" Uh, such a thing happened? He looked back on his memories and remembered that he had indeed introduced these weapons to her. Could it have been at that time? But he was not a careless person, why would he forget to keep them after showing them to her?

source: “……”啥意思？什么没吃完，水果吗？可刚刚吃水果的人，不只有沈掌门吗？
en_us: "..." What does that mean? What hasn't he finished eating? Fruits? But wasn't Sect Master Shen the one who was eating the fruits?

source: “……”啥？
en_us: "…" What?

source: “……”女子脸抽畜了一下，喂，别骂人啊。
en_us: "…" The woman's face twitched. Hey, don't insult me.

source: “……”她是小孩吗，这么容易被拐。
en_us: "…" Was she a child who was so easily abducted?

source: “……”她的名字这么难记吗？
en_us: “……”Is her name that hard to remember？

source: “……”好吃好吃好吃。
en_us: "…" It was very, very, very delicious.

source: “……”好麻烦啊。
en_us: "..." So troublesome.

source: “……”孤月一愣，没由来的就静下了急躁的心。
en_us: "…" Lonemoon hesitated. He slowly calmed down and said nothing further.

source: “……”孤月一愣，确实大道三千，羿清是羿清，他是他。修道本来就是修自己的道，与其它人无关。羿清能得顿悟那是他自己的造化，他能穿越到这个世界，也是自己的造化，又何必纠结于这些。
en_us: "..." Lonemoon fell silent. Indeed, there were many paths to the Great Dao. Yi Qing and he were separate entities. The cultivation of Dao actually means cultivating one's own Dao, it does not concern other people. Yi Qing's breakthroughs were his karma. He, Lonemoon could transmigrate to this world, that was also his karma. So why bother with such trivialities.

source: “……”孤月一愣，这才明白她问的什么，皱了皱眉顺手给自己倒了杯茶道，“你什么时候看出来的？”明明他根本没有提起过。
en_us: "..." Lonemoon paused and finally understood what she was asking. He frowned and poured himself a cup of tea. "When did you find out?" He had never mentioned it before.

source: “……”孤月只觉得心口一塞，一口老血涌了上来。深吸了一口气才压了下去，淡定淡定，她还是个萌新，虽然是变态级别的那种，“灵气是修士修练必不可少的东西，就像人要吃饭一样，修士只有呼吸吐纳天地间的灵气才能提升修为。各种法术剑术都要依赖灵气运转。”
en_us: "…" Lonemoon felt a stuffiness in his chest, a mouthful of blood threatening to rush out of his mouth. He took a deep breath before it was kept under control. Keep your cool, she is still a newbie, although she is the type that is rarely seen. "Spirit Qi is something that cultivators require for cultivation. Just like how humans need to eat to survive, cultivators must breathe the Spirit Qi of the Earth and Sky to improve their cultivation. All kinds of Dharma spells rely on how the Spirit Qi is manipulated."

source: “……”孤月嘴角一抽，他不是嫌少啊喂！这只吃鸡还不忘付钱的妖怪到底从哪来的？
en_us: "…" Lonemoon's mouth twitched. I'm not concerned about the amount! This demon even remembers to settle the bill for for his meal! I wonder where he comes from?

source: “……”孤月嘴角一抽，关他毛事，这明显是沈萤抖出来的好吗？
en_us: "…" Lonemoon's mouth twitched. What has that got to do with me, wasn’t it obviously shaken out by Shen Ying?

source: “……”孤月愣了一下，半会似是想到了什么。
en_us: "..." Lonemoon faltered before he thought of something.

source: “……”孤月沉默了，上青界这么多年来，唯一传说飞升成功的，就只有郁家老祖，但上次升仙塔的事后。才知道他并没有成功，而是入了魔。这么说，还真没有飞升成功的仙人。他顿时迷惑了，难道这个世界真的没有天门？！
en_us: "..." Lonemoon fell silent. After all these years, the only person whom he heard had achieved immortality was the ancestor of the Yu Family. After what happened with the Immortal Ascension Pagoda, he knew that that ancestor had not actually succeeded - he had just turned into a demon. That means there was indeed nobody who ascended into immortality. At that moment, he felt completely confused. Was there really no Heavenly Gate in this realm?

source: “……”孤月没有回答，眉头却皱得更紧了，若不是见到白泽，他都快忘了这是一本书里写的世界。
en_us: "..." Lonemoon did not answer her; he only frowned more deeply. If he had not seen Bai Ze, he would have fogotten that this was a world that belonged in the book.

source: “……”孤月没有回话，这的确是现在唯一的办法。
en_us: "..." Lonemoon did not respond. This was really the only way.

source: “……”孤月皱了皱眉，却没这么乐观，那本书的剧情里，可没有提到有什么办法。
en_us: "..." Lonemoon frowned. He was not so hopeful, as according to the book, there was no solution mentioned for this.

source: “……”孤月脸色一僵，顿时想起书中的描写，只觉得心梗了一下，上不来下不去的。
en_us: "…" Lonemoon's face stiffened as he thought of what the book described and felt a stuffiness in his chest.

source: “……”心好累！
en_us: "..." My heart is so weary!

source: “……”感觉萝卜心中了一箭。
en_us: "..." Radish felt an arrow to the heart.

source: “……”我没用意啊。
en_us: "…" I didn't intend anything.

source: “……”我的刀呢？
en_us: "..." Where's my sword?

source: “……”戚橙雨手间一紧，一个噬心诀差点就随着一口老血扔了过去，“你是不是想找死！说了让你往右走，往右，你到底认不认路？”
en_us: "…" Qi Chengyu clenched her hands and almost vomited blood. "Do you want to die! I told you go to the right, to the right, can't you follow directions?"

source: “……”所以万妖的死，是因为开会声音太大？
en_us: "…" The reason why so many demons died was simply because they were too loud?

source: “……”所以天生剑体，是因为产妇营养过剩造成的吗？这事厨子知道吗？
en_us: "..." So, a natural powerhouse is formed from the overfeeding of the expectant mother? Does the chef know about this matter?

source: “……”所以说死的那些妖族，之所以尸骨无存，是因为都做成了食物？说好的断食辟谷是人修入门必备呢？三宗六派这群骗子！
en_us: "…" So the reason why there were no remains left from those demons was because they were used as food? Wasn't grain abstinence a fundamental requirement for human cultivators? That bunch of liars from the Six Schools Three Sects!

source: “……”所以那魔窟的事真是她做的啊喂！“这些人又怎么回事？”他指了指她身边的一群去而复返的妹子，“你又揍了谁？”
en_us: "…" So she was really the one who took down the Fiend Den! "What are these people doing here?" He pointed to the group of girls who had returned from their escapade. "Who did you hit this time?"

source: “……”无法反驳。
en_us: "..." Lonemoon could find no words to rebut her.

source: “……”易峰一脸懵逼。
en_us: "..." Yi Feng's expression tightened..

source: “……”易峰嘴角一抽，毛团是什么鬼？眼看着事情瞒不下去，只好主动解释，“灵主是神兽白泽，这万年来一直住在我易家万兽峰，为的就是不让幻海异兽随意踏足三青界，为祸人间。”
en_us: "..." Yi Feng's mouth twitched. What the hell was a furball? Seeing that there was no way he could conceal the matter any longer, he explained, "This divine beast is Spirit Master Bai Zhe. He has been living in my Yi Family's Myriad Beast Peak for ten thousand years, defending the three Azure worlds from invasion by Mirage Sea beasts.

source: “……”易峰想死。
en_us: "..." Yi Feng wished he could die at that moment.

source: “……”果然还是不平衡，沈心机！￣へ￣
en_us: "..." He was indeed biased, scheming Shen! ￣へ￣

source: “……”槽！
en_us: "..." Shit!

source: “……”槽！你怎么什么都答应，“这种地方连上青界都难有，妖界这么大，就算有也很难找……”
en_us: "…" Holy shit! Why are you agreeing to everything? "It’s hard to find such a place even in the Upper Azure World. The Demon Realm is so big. Even if there were such a place, it would be very difficult to find…"

source: “……”毕浩一惊，他居然没有发现，魔尊旁边还有一人。细一看却发现对方只是毫无灵气的凡人，顿时松了口气。想要收回手，却发现抽……不回来！
en_us: "…" Bi Hao was taken aback. He had not realized there was someone else beside the Fiend Supremacy. Taking a closer look, he saw that this person was a mortal with no Spirit Qi, after which he heaved a sigh of relief.

source: “……”沈萤一僵，额头又开始冒汗了，指教啥？剑法什么的，她压根不懂啊。
en_us: "…" Flustered, Shen Ying began to perspire. What guidance could she give? She didn't know anything about sword techniques.

source: “……”沈萤嘴角一抽，看着眼前这只仿佛整根萝卜都写着，你看不见我，你看不见我，你看不见我的萝卜，所以这是个智商不太高的萝卜精吗？
en_us: "…" The corner of Shen Ying's mouth twitched. She could almost hear the thoughts in the radish's mind: You can't see me, you can't see me, you can't see this radish… Was this a particularly stupid radish spirit?

source: “……”沈萤嘴角一抽，这家伙吃炸药了？画风跟之前完全不同了。
en_us: "…" Shen Ying's mouth twitched. Did this fellow eat an explosive? He had an entirely different style from before.

source: “……”沈萤嘴角抽了抽，顺手接了过去，左右看了看，也没看出什么不同来，“我也没见过这花……”
en_us: "..." The corner of Shen Ying's mouth twitched as she received the flower and turned it around in her hands to study it from all angles. She did not find anything special either. "I have never seen this flower..."

source: “……”河对岸！
en_us: "..." Opposite shore of the river!

source: “……”灵主原来这么热心的吗？
en_us: "..." Has Spirit Master always been this passionate?

source: “……”猫奴什么鬼，“那只是他的灵兽。”
en_us: "..." What do you mean by cat slave. "That's just his spirit beast."

source: “……”睡你妹啊，你除了吃和睡还有没有点别的爱好，那边打架的是你亲徒弟吗？
en_us: "…" Sleep my ass! What else do you do besides eating and sleeping? Do you really take that fellow as your disciple?

source: “……”素菜家族是什么？他是家主，不是什么家长啊？还有这种把游仙当孙子训的口气是肿么回事？
en_us: "…" What Vegetable Family? He was the master of the family, not the parent. And why was she talking to the Traveling Immortal as if he was her grandson?

source: “……”羿清一呆，片刻脸上浮现巨大的欣喜，急喘了两口声，朝着她用力的嗑了三个头，“多谢前辈成全，徒儿羿清，见过师父。”
en_us: "..." Yi Qing was stunned for a moment, then his face broke into a huge grin. Taking a few deep breaths, he turned toward her and bowed three times. "Thank you for granting my request, Senior. I am your disciple, Yi Qing. Please accept my respects, Master."

source: “……”羿清愣住了，想了半会，拼命想要找个顺眼的，却发现好像没人配得上自己完美的师父。甚至光想想师父身边会出现另一个人，他就没由来的有些暴躁。
en_us: "..." Yi Qing stopped short. He kept quiet for a second trying to think of someone pleasing to the eye, but he realised that no one around him could match up to his master, who was perfect in his eyes. Just thinking about another person hanging around Master made his heart race with anger.

source: “……”脑海顿时闪过了某个画面，在场众人齐齐抽了抽嘴角。
en_us: "…" A certain image flashed past Xuan Yuanyu’s mind and everybody present pursed their lips at the same time..

source: “……”膝盖中了一剑。
en_us: "..." Took an arrow in the knee[1. is a memorable quote originating from the role-playing video game The Elder Scrolls V: Skyrim. An often repeated stock line throughout the game, it went on to inspire the snowclone “I used to X, then I took an arrow to the knee.”]

source: “……”舔你妹啊，以为这是打游戏啊？你丫的就是想捡钱吧？我都看到你装口袋里了，“把金子给我放下啊喂！”
en_us: "…" Picking up loot my foot! You think you are playing an online game? I think you just want to pocket the money. I saw you put them in your pocket. "Put down the gold pieces!"

source: “……”要不要答应得这么快啊？不会真有吧？“就算妖界有这样的地方，也不可能生出灵脉吧？”
en_us: "…" Do you have to agree so quickly? Is there really such a place? "Even if there is such a place in the Demon Realm, surely it can’t produce a spirit vein?"

source: “……”要不要这么现实啊喂？好歹是上古传承，别这么嫌弃啊？
en_us: "…" They didn't have to be so practical, did they? This was an ancient heritage they were being asked to receive — how could they despise it so?

source: “……”要不要这么贴心？
en_us: "…" Do you need to be so considerate?

source: “……”觉得这个理由一点都不意外是肿么回事？
en_us: "…" Why did this reason not sound surprising at all?

source: “……”说到底，你丫还是舍不得这些吃的啊喂！
en_us: "…" At the end of the day, all you're concerned about is food!

source: “……”说得好有道理，他竟无言以对。
en_us: "…" This made so much sense that Lonemoon was speechless.

source: “……”谁能跟你个外挂比！
en_us: "..." Who wants to be compared with a cheat like you!

source: “……”轩辕禹嘴角一抽，似是想到了什么，隐隐觉得一口老血涌了上来。看了看后面出来的沈萤，不得不得又硬咽了下去。
en_us: "…" The corner of Xuan Yuanyu's mouth twitched. He suddenly recalled something and felt his blood pressure begin to rise. Upon seeing Shen Ying following behind the radish, however, he had no choice but to swallow his anger.

source: “……”这么厉害的吗？
en_us: "..." Is it that unbelievable?

source: “……”这也可以睡着，你TM在逗我？！
en_us: "…" Sleeping in this situation, are you freaking kidding me?!

source: “……”这是在转移话题吧，绝对是的吧？
en_us: “……”She is trying to change the topic, right？

source: “……”这是忘了吧？绝对是忘了吧。
en_us: "..." You forgot right? You definitely forgot.

source: “……”这货到底怎么靠着一脸懵逼活到现在的？！
en_us: "…" How did she survive until now with that stupid face of hers?!

source: “……”这进来的都是一群什么奇葩啊喂，打架比传承更重要吗？有没有人听他说话！
en_us: "…" These few people that came in were weirdos. Was fighting more important than passing on the legacy? Was anybody even listening to him?!

source: “……”那你有什么脸收徒啊喂！
en_us: "…" Yet you have the cheek to take in a disciple!

source: “……”郁海珩心口又是一塞。
en_us: "..." Yu Hai Heng was dumbfounded.

source: “……”郁红嘴角抽了抽，看着这个哪哪都不靠谱的所谓掌门，半会才压下心底的冲动道，“既然如此……已经入门，以后诸事还望掌门安排？”
en_us: "…" Yu Hong's mouth twitched as she looked at this unreliable so-called sect master, and it took her a while before suppressing the impulse to act rashly and said, "If that's the case… now that we have entered this sect, we hope that Sect Master will help us to make arrangements for future matters."

source: “……”随意是什么鬼？“掌门，我等入门不需厅登记入册之类的吗？”
en_us: "…" What did that mean? "Sect Master, don't we need to register or something?"

source: “……”难吃还不让人说了，委屈。
en_us: "..." I'm not even allowed to criticize bad cooking. Sad.

source: “……”马屁拍在马腿上的魔王一缩，又团成了鹌鹑。大仙好凶，好无常，好无理取闹！
en_us: "..." The boot-licking Devil King quivered and shrunk back to his quail-like form. The Great Immortal was fierce, irrational and unreasonable!

source: “……”鬼要跟你一起吃啊！原来你之前问的可不可以吃，是真的想吃啊喂。
en_us: "..." I'm not going to eat that with you! So you were really thinking of eating the beasts when you asked if they could be eaten earlier?

source: “……不会。”
en_us: "... No."

source: “……不说就算了。”
en_us: "... If you don't want to tell me, then forget it."

source: “……也没多担心。”干活的都是牛爸爸，她只在旁边坐坐。
en_us: "... I was not really worried." The grunt work was done by Father Niu, all she did was sit on the chair.

source: “……卑鄙！”
en_us: "Despicable!"

source: “……叽。”
en_us: "… Ji."

source: “……哈？！”
en_us: ".... Huh?!"

source: “……哦。”
en_us: "... Oh."

source: “……啊？啊！”碧涛傻了。
en_us: "... Ah? Ah!" Bitao went silent.

source: “……啥？！”这什么鬼理由？
en_us: "… What?!" What the heck was that reason?

source: “……嗯。”
en_us: "... Yes."

source: “……我TM还卤煮，生煎，暴炒呢！”
en_us: "... How about freaking braised, pan fried and deep fried!"

source: “……我说的到不是这个。”
en_us: "... this is not what I meant."

source: “……是这样吗？”
en_us: "... Is that it?"

source: “……是，师父。”羿清只好又蹲了回去，却忍不住回头警告似的瞪向那五人，虽然能猜到他们会来抢千叶草木灵，却没想到会来得这么快，竟是连片刻都等不下去了吗？没想到堂堂上界世家，吃相也是一样的难看。
en_us: "… Yes, Master," Yi Qing obediently squatted back down but he couldn't stop himself from throwing a warning glare at the five strangers standing in front of them. He had guessed that they would come to steal the Thousand Leaves Vegetation Spirit, but he didn't think they would be so fast. Could they really not wait any longer? To think that an aristocratic family from the Upper World would have such an ugly, greedy side.

source: “……是，师父。”羿清这才一步三回头的走了，临出门还冷冷的瞪了思羽一眼。小婊砸，又来抢我师父！
en_us: "... Yes, Master." Yi Qing started to walk out, but not without turning back every few steps. Just before he stepped out of the door, he glared at Si Yu coldlly. Little girl, trying to steal my master again!

source: “……没。”
en_us: "… No."

source: “……滚。”谁想给你钱了，你TM能不能忘了牛爸爸这回事，“你丫有这么穷吗？算了，看在你帮我一回的份上。以后你要是缺灵石，尽量来找哥，我罩你。”他好歹是个化神尊者，灵石还是不缺的。
en_us: "… Get lost." Who wants to give you money, can you just forget about the Father Niu incident? "Are you really that broke? Forget it, since you have helped me before, next time when you are in need of spirit stones, feel free to come and find your brother, I will take care of you." Anyhow, he was a Soul Formation Supremacy; he was not lacking in spirit stones.

source: “一万两！”
en_us: "Ten thousand taels!"

source: “一两紫金一天啊！一两紫金那可是能在风月楼包个花魁玩上十天十夜了，可惜我武技不行啊，否则一定要进去混个金牌陪练玩玩。”
en_us: "A tael of purple gold a day! One tael of purple gold can allow me to book a courtesan at the Fengyue Brothel and have fun with her for ten entire days and nights! Sadly, my skills are not good enough, otherwise I would definitely go in and pass off as a good token-grade sparring partner and have some fun."

source: “一两紫金一天？拼了，去试试！”
en_us: One tael of purple gold a day? I'll risk it and go for broke!

source: “一两紫金？”
en_us: "One tael of purple gold?"

source: “一个月？”
en_us: "A month?"

source: “一些灵根不好，或是原本就仙途无望，却颇有姿色的女子，为了自保，会甘愿成为炉鼎。依副于高阶修士之下，以自身修为供人采补。”他脸上全是尴尬，似是有些难以启齿，“虽然双修采补之术，不是什么上得台面的术法。但对修为确实有益，所以绻养炉鼎在各门各派来说，很……常见！大部分金丹以上的修士，都有这种习惯。”
en_us: "Some of those girls without good spirit roots, or those who did not have a future with immortal cultivation but are rather pretty will be willing to become a human cauldron for self-protection. Going under the wings of a high level cultivator, they allow the use of their bodies to provide harvest for others." His expression was completely awkward, seemingly finding it hard to speak about this matter. "While dual cultivation harvesting sorcery is not glamorous, it really does help with cultivation, so to many sects, keeping a human cauldron is… very common! Most of the cultivators with Golden Cores and above have experienced this kind of practice."

source: “一力……降十会？一力降十会……”羿清默念了几句，突然身上灵气暴涨，剑气满溢，连着四周的灵气都开始涌动起来。
en_us: "One strong man… can overcome ten? One strong man can overcome ten…" Yi Qing silently recited this a few times. Suddenly, the Spirit Qi and Sword Qi in his body started to soar and even the Spirit Qi in the surrounding began to surge in response.

source: “一句失误就完了，没那么容易！你们刚刚吃的那顿，可都是灵植灵米做的，少说也有十几块下品灵石。”
en_us: "You expect this to be over just because you claim it was a mistake? It's not so easy! All the food you ate earlier on was made from spirit herbs and spirit rice. It would cost you more than ten low-grade spirit stones."

source: “一年前振祥真人突然损落，却连遗体都找不着。”郁海衍继续道，“他死后门下九名炉鼎也消失了踪迹，据最后看到振祥的人说，他是因为法器被盗，前去捉拿盗宝的叛徒才一去不返的。定是被那九人所害，我做为家主，自然要帮门下的人讨回这个公道。”
en_us: "One year ago, the Perfected One Zhen Xiang suddenly fallen yet his body was nowhere to be found." Yu Hai Heng continued, "After his death, the nine human cauldrons under him also vanished. According to the person who last saw Zhen Xiang, he did not return from chasing the betrayer who stole his Dharma artifact. He was certainly harmed by those nine of them, as the Master of the family, of course I have to help my people seek justice。

source: “一时说不清楚，师叔随我去一趟药丹峰就明白了！”他脸色更为沉重，转头看了羿清一眼，继续抱拳道，“恭喜羿道友顺利结婴，此事关系重大，羿真人也一块过来吧！多事之秋，真人的结婴大典估计要延后些时日了。”
en_us: "I can't explain it clearly. Let me bring Uncle Master to Elixir Peak and you will understand!" His expression was grave as he turned around to look at Yi Qing and cupped his fists before continuing, "Congratulations to Fellow Daoist Yi Qing for successfully completing your Nascent Soul Formation. Since this matter is pretty serious, Perfected Yi, you come along as well! With so much happening recently, Perfected Yi’s Nascent Soul Formation ceremony will have to be pushed back."

source: “一派胡言。”郁海珩急了，似是没有想她会说这些反驳道，“振祥是旁系中出了名的随和之人，谁会相信他会做这种事？”
en_us: "That's all nonsense." Yu Hai Heng panicked as if not expecting her to rebut like that, "Zhen Xiang was the collateral kin who was known for being friendly and amicable, who would believe he'd done such things?"

source: “一缕大半柱香时间，十缕差不多能坚持一个时辰！”
en_us: "If one wisp can last for more than two and a half minutes, ten wisps can last more almost two hours!"

source: “万一又有哪个不长眼的拐走了师父怎么办？还是我守在这里更安全。”
en_us: "What if another person who does not look where they are going came to abduct Master again? It is safer for me to stand guard here."
